//
//-------------------------------------------------------------------
//----------x Перечисленеие реализующее состояние врагов. х----------
//----------х Moving - враг движется.                     х----------
//----------х Stopped - враг стоит.                       х----------
//----------х MovingLeft, MovingUp, MovingDown ... - враг х----------
//----------х движется в определенном направлении.        х----------
//----------х !!! Moving необходимо для проверки движется х----------
//----------х ли враг. Если он движется то проверяется в  х----------
//----------х каком именно направлении.                   х----------
//-------------------------------------------------------------------
//
namespace South_Park
{
    enum EnemyCondition
    {
        Moving, 
        Stopped,
        MovingLeft,
        MovingLeftUp,
        MovingUp,
        MovingRightUp,
        MovingRight,
        MovingRightDown,
        MovingDown,
        MovingLeftDown,
    }
}